<a href="https://colab.research.google.com/github/HaseenaB/python-coding/blob/master/Joins.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd

In [0]:
d1=pd.DataFrame({"Name":["Haseena","Shindu","Thabeena","Thariq"],"Age":[27,23,2,33],"Department":["CSE","IT","ECE","EEE"]})

In [0]:
d2=pd.DataFrame({"Name":["Haseena","Shindu","Thabeena","Thariq","Sarama"],"Year_of_Join":[2017,2013,2016,2003,2012]})

In [0]:
d3=pd.merge(d1,d2)

In [0]:
d3

   Age Department      Name  Year_of_Join
0   27        CSE   Haseena          2017
1   23         IT    Shindu          2013
2    2        ECE  Thabeena          2016
3   33        EEE    Thariq          2003
4   22        CSE    Sarama          2012

In [0]:
d1=pd.DataFrame({"Name":["Haseena","Shindu","Thabeena","Thariq","Sarama"],"Age":[27,23,2,33,22],"Department":["CSE","IT","ECE","EEE","CSE"]})

In [0]:
d1

   Age Department      Name
0   27        CSE   Haseena
1   23         IT    Shindu
2    2        ECE  Thabeena
3   33        EEE    Thariq
4   22        CSE    Sarama

In [0]:
d4=pd.DataFrame({"Department":["CSE","IT","ECE","EEE"],"HOD":["GK","DIM","GSK","EDE"]})

In [0]:
d5=pd.merge(d1,d4)

In [0]:
d5

   Age Department      Name  HOD
0   27        CSE   Haseena   GK
1   22        CSE    Sarama   GK
2   23         IT    Shindu  DIM
3    2        ECE  Thabeena  GSK
4   33        EEE    Thariq  EDE

In [0]:
d_1=pd.merge(d1,d2,how='right')

In [0]:
d_1

   Age Department      Name  Year_of_Join
0   27        CSE   Haseena          2017
1   23         IT    Shindu          2013
2    2        ECE  Thabeena          2016
3   33        EEE    Thariq          2003
4   22        CSE    Sarama          2012